Documents/ОказаниеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОказаниеУслуги</Name>
			<Comment>Оказание услуги</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Инвентарь</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Comment>Мастер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>ВидОплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>СуммаДокумента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ПереченьНоменклатура</Name>
					<Comment>Перечень номенклатура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Comment>Материал</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Comment>Набор свойств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Услуги</Name>
					<Comment>Услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОказаниеУслуги/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОказаниеУслуги.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОказаниеУслуги.ВидОплаты,
	|	ОказаниеУслуги.Дата,
	|	ОказаниеУслуги.Клиент,
	|	ОказаниеУслуги.Мастер,
	|	ОказаниеУслуги.Номер,
	|	ОказаниеУслуги.СуммаДокумента,
	|	ОказаниеУслуги.Ссылка,
	|	ОказаниеУслуги.ТЧ_ПереченьНоменклатура.(
	|		НомерСтроки,
	|		Материал,
	|		Материал.Ссылка КАК Ссылка,
	|		Количество,
	|	),
	|	ОказаниеУслуги.ТЧ_Услуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.Ссылка КАК Ссылка,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОказаниеУслуги КАК ОказаниеУслуги
	|ГДЕ
	|	ОказаниеУслуги.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ПереченьНоменклатураШапка = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатураШапка");
	ОбластьТЧ_ПереченьНоменклатура = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатура");
	ОбластьТЧ_УслугиШапка = Макет.ПолучитьОбласть("ТЧ_УслугиШапка");
	ОбластьТЧ_Услуги = Макет.ПолучитьОбласть("ТЧ_Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		СсылкаНаДок = Выборка.Ссылка;
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Если СсылкаНаДок.ТЧ_ПереченьНоменклатура.Количество() > 0 тогда
			ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатураШапка);
		КонецЕсли;
		
		ВыборкаТЧ_ПереченьНоменклатура = Выборка.ТЧ_ПереченьНоменклатура.Выбрать();
		Пока ВыборкаТЧ_ПереченьНоменклатура.Следующий() Цикл
			ОбластьТЧ_ПереченьНоменклатура.Параметры.Заполнить(ВыборкаТЧ_ПереченьНоменклатура);
			ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатура, ВыборкаТЧ_ПереченьНоменклатура.Уровень());
		КонецЦикла;

		Если СсылкаНаДок.ТЧ_Услуги.Количество() > 0 тогда
			ТабДок.Вывести(ОбластьТЧ_УслугиШапка);
		КонецЕсли;
		
		ВыборкаТЧ_Услуги = Выборка.ТЧ_Услуги.Выбрать();
		Пока ВыборкаТЧ_Услуги.Следующий() Цикл
			ОбластьТЧ_Услуги.Параметры.Заполнить(ВыборкаТЧ_Услуги);
			ТабДок.Вывести(ОбластьТЧ_Услуги, ВыборкаТЧ_Услуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
